#This program tries to do an analysis for the Walmart Recruiting - Store Sales Forecasting Dataset.

In [ ]:
#Import the necessary libraries
import pandas as pd
import numpy as np
import seaborn as sns

# Data Collection

In [ ]:
#Load the data
from google.colab import files
uploaded=files.upload()

Saving features.csv to features (1).csv
Saving stores.csv to stores (1).csv
Saving test.csv to test (1).csv
Saving train.csv to train (1).csv

In [ ]:
#Store the data into a dataframe variable
features=pd.read_csv('features.csv')
stores=pd.read_csv('stores.csv')
train=pd.read_csv('train.csv')
test=pd.read_csv('test.csv')

## Stores Data

In [ ]:
#Show first five rows of the stores data. 
stores.head()

   Store Type    Size
0      1    A  151315
1      2    A  202307
2      3    B   37392
3      4    A  205863
4      5    B   34875

In [ ]:
#Show the shape of stores data
print(stores.shape)

#Show the unique values of Store Type
print(stores['Type'].unique())

(45, 3)
['A' 'B' 'C']

## Features Data

In [ ]:
#Show first five rows of the features data. 
features.head()

   Store        Date  Temperature  ...         CPI  Unemployment  IsHoliday
0      1  2010-02-05        42.31  ...  211.096358         8.106      False
1      1  2010-02-12        38.51  ...  211.242170         8.106       True
2      1  2010-02-19        39.93  ...  211.289143         8.106      False
3      1  2010-02-26        46.63  ...  211.319643         8.106      False
4      1  2010-03-05        46.50  ...  211.350143         8.106      False

[5 rows x 12 columns]

In [ ]:
features.tail()

      Store        Date  Temperature  ...  CPI  Unemployment  IsHoliday
8185     45  2013-06-28        76.05  ...  NaN           NaN      False
8186     45  2013-07-05        77.50  ...  NaN           NaN      False
8187     45  2013-07-12        79.37  ...  NaN           NaN      False
8188     45  2013-07-19        82.84  ...  NaN           NaN      False
8189     45  2013-07-26        76.06  ...  NaN           NaN      False

[5 rows x 12 columns]

In [ ]:
#Showing the basic info of features data
features.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8190 entries, 0 to 8189
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Store         8190 non-null   int64
 1   Date          8190 non-null   object
 2   Temperature   8190 non-null   float64
 3   Fuel_Price    8190 non-null   float64
 4   MarkDown1     4032 non-null   float64
 5   MarkDown2     2921 non-null   float64
 6   MarkDown3     3613 non-null   float64
 7   MarkDown4     3464 non-null   float64
 8   MarkDown5     4050 non-null   float64
 9   CPI           7605 non-null   float64
 10  Unemployment  7605 non-null   float64
 11  IsHoliday     8190 non-null   bool
dtypes: bool(1), float64(9), int64(1), object(1)
memory usage: 712.0+ KB

In [ ]:
#Converting the object datatype of Date to datetime specific format
features['Date'] = pd.to_datetime(features['Date'], format='%Y-%m-%d')

In [ ]:
#Again checking the info
features.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8190 entries, 0 to 8189
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Store         8190 non-null   int64
 1   Date          8190 non-null   datetime64[ns]
 2   Temperature   8190 non-null   float64
 3   Fuel_Price    8190 non-null   float64
 4   MarkDown1     4032 non-null   float64
 5   MarkDown2     2921 non-null   float64
 6   MarkDown3     3613 non-null   float64
 7   MarkDown4     3464 non-null   float64
 8   MarkDown5     4050 non-null   float64
 9   CPI           7605 non-null   float64
 10  Unemployment  7605 non-null   float64
 11  IsHoliday     8190 non-null   bool
dtypes: bool(1), datetime64[ns](1), float64(9), int64(1)
memory usage: 712.0 KB

In [ ]:
features.head()

   Store       Date  Temperature  ...         CPI  Unemployment  IsHoliday
0      1 2010-02-05        42.31  ...  211.096358         8.106      False
1      1 2010-02-12        38.51  ...  211.242170         8.106       True
2      1 2010-02-19        39.93  ...  211.289143         8.106      False
3      1 2010-02-26        46.63  ...  211.319643         8.106      False
4      1 2010-03-05        46.50  ...  211.350143         8.106      False

[5 rows x 12 columns]

In [ ]:
#Show the shape of features data
print(features.shape)

(8190, 12)

In [ ]:
#Checking whether there are null values
features.isnull().any()

Store           False
Date            False
Temperature     False
Fuel_Price      False
MarkDown1        True
MarkDown2        True
MarkDown3        True
MarkDown4        True
MarkDown5        True
CPI              True
Unemployment     True
IsHoliday       False
dtype: bool

We find that there are null values for MarkDown (1-5), CPI and Unemployment. Below shows the descriptive statistics of the features data

In [ ]:
features.describe()

             Store  Temperature  ...          CPI  Unemployment
count  8190.000000  8190.000000  ...  7605.000000   7605.000000
mean     23.000000    59.356198  ...   172.460809      7.826821
std      12.987966    18.678607  ...    39.738346      1.877259
min       1.000000    -7.290000  ...   126.064000      3.684000
25%      12.000000    45.902500  ...   132.364839      6.634000
50%      23.000000    60.710000  ...   182.764003      7.806000
75%      34.000000    73.880000  ...   213.932412      8.567000
max      45.000000   101.950000  ...   228.976456     14.313000

[8 rows x 10 columns]

## Train Data

In [ ]:
#Show first five rows of the training data. 
train.head()

   Store  Dept       Date  Weekly_Sales  IsHoliday
0      1     1   2/5/2010      24924.50      False
1      1     1  2/12/2010      46039.49       True
2      1     1  2/19/2010      41595.55      False
3      1     1  2/26/2010      19403.54      False
4      1     1   3/5/2010      21827.90      False

In [ ]:
train.tail()

        Store  Dept        Date  Weekly_Sales  IsHoliday
421565     45    98   9/28/2012        508.37      False
421566     45    98   10/5/2012        628.10      False
421567     45    98  10/12/2012       1061.02      False
421568     45    98  10/19/2012        760.01      False
421569     45    98  10/26/2012       1076.80      False

In [ ]:
print(train.shape)

(421570, 5)

In [ ]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 421570 entries, 0 to 421569
Data columns (total 5 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   Store         421570 non-null  int64
 1   Dept          421570 non-null  int64
 2   Date          421570 non-null  object
 3   Weekly_Sales  421570 non-null  float64
 4   IsHoliday     421570 non-null  bool
dtypes: bool(1), float64(1), int64(2), object(1)
memory usage: 13.3+ MB

In [ ]:
train['Date'] = pd.to_datetime(train['Date'], format='%m/%d/%Y')

In [ ]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 421570 entries, 0 to 421569
Data columns (total 5 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   Store         421570 non-null  int64
 1   Dept          421570 non-null  int64
 2   Date          421570 non-null  datetime64[ns]
 3   Weekly_Sales  421570 non-null  float64
 4   IsHoliday     421570 non-null  bool
dtypes: bool(1), datetime64[ns](1), float64(1), int64(2)
memory usage: 13.3 MB

In [ ]:
train.head()

   Store  Dept       Date  Weekly_Sales  IsHoliday
0      1     1 2010-02-05      24924.50      False
1      1     1 2010-02-12      46039.49       True
2      1     1 2010-02-19      41595.55      False
3      1     1 2010-02-26      19403.54      False
4      1     1 2010-03-05      21827.90      False

In [ ]:
train.describe()

               Store           Dept   Weekly_Sales
count  421570.000000  421570.000000  421570.000000
mean       22.200546      44.260317   15981.258123
std        12.785297      30.492054   22711.183519
min         1.000000       1.000000   -4988.940000
25%        11.000000      18.000000    2079.650000
50%        22.000000      37.000000    7612.030000
75%        33.000000      74.000000   20205.852500
max        45.000000      99.000000  693099.360000

Here, from above we can see that the minimum value of weekly sales has gone to -4988; which is not possible. The weekly sales minimum can be 0, not less than that. We will do a subsequent analysis to identify the outliers.

In [ ]:
#Checking whether there are null values.
train.isnull().any()

Store           False
Dept            False
Date            False
Weekly_Sales    False
IsHoliday       False
dtype: bool

In [ ]:
#Show the unique departments in whole dataset.
print(train['Dept'].unique())

[ 1  2  3  4  5  6  7  8  9 10 11 12 13 14 16 17 18 19 20 21 22 23 24 25
 26 27 28 29 30 31 32 33 34 35 36 37 38 40 41 42 44 45 46 47 48 49 51 52
 54 55 56 58 59 60 67 71 72 74 77 78 79 80 81 82 83 85 87 90 91 92 93 94
 95 96 97 98 99 39 50 43 65]

## Group the train data based on 45 different stores and find the sum of overall sales of the stores.

In [47]:
train_wo_dept=train.groupby(['Date','Store'] ,as_index=False).agg({"Weekly_Sales": "sum"})

In [48]:
train_wo_dept

           Date  Store  Weekly_Sales
0    2010-02-05      1    1643690.90
1    2010-02-05      2    2136989.46
2    2010-02-05      3     461622.22
3    2010-02-05      4    2135143.87
4    2010-02-05      5     317173.10
...         ...    ...           ...
6430 2012-10-26     41    1316542.59
6431 2012-10-26     42     514756.08
6432 2012-10-26     43     587603.55
6433 2012-10-26     44     361067.07
6434 2012-10-26     45     760281.43

[6435 rows x 3 columns]

## Merging the features and the new dataframe train_wo_dept for subsequent EDA

In [ ]:
merged_df_wo_dept= pd.merge(features, train_wo_dept, on=["Store", "Date"])

In [ ]:
merged_df_wo_dept

      Store       Date  Temperature  ...  Unemployment  IsHoliday  Weekly_Sales
0         1 2010-02-05        42.31  ...         8.106      False    1643690.90
1         1 2010-02-12        38.51  ...         8.106       True    1641957.44
2         1 2010-02-19        39.93  ...         8.106      False    1611968.17
3         1 2010-02-26        46.63  ...         8.106      False    1409727.59
4         1 2010-03-05        46.50  ...         8.106      False    1554806.68
...     ...        ...          ...  ...           ...        ...           ...
6430     45 2012-09-28        64.88  ...         8.684      False     713173.95
6431     45 2012-10-05        64.89  ...         8.667      False     733455.07
6432     45 2012-10-12        54.47  ...         8.667      False     734464.36
6433     45 2012-10-19        56.47  ...         8.667      False     718125.53
6434     45 2012-10-26        58.85  ...         8.667      False     760281.43

[6435 rows x 13 columns]

## Find correlation of the features to the weekly sales at different stores (1-45)

In [ ]:
merged_df_wo_dept.groupby('Store').corr()['Weekly_Sales'].head(60)

Store
1      Temperature    -0.222701
       Fuel_Price      0.124592
       MarkDown1       0.090808
       MarkDown2      -0.109071
       MarkDown3       0.373671
       MarkDown4       0.088901
       MarkDown5      -0.034559
       CPI             0.225408
       Unemployment   -0.097955
       IsHoliday       0.194905
       Weekly_Sales    1.000000
2      Temperature    -0.297673
       Fuel_Price     -0.196375
       MarkDown1      -0.042901
       MarkDown2      -0.106018
       MarkDown3       0.396113
       MarkDown4      -0.023552
       MarkDown5       0.007853
       CPI            -0.062431
       Unemployment    0.066325
       IsHoliday       0.177726
       Weekly_Sales    1.000000
3      Temperature    -0.377524
       Fuel_Price      0.140886
       MarkDown1      -0.012630
       MarkDown2      -0.138621
       MarkDown3       0.495054
       MarkDown4       0.169554
       MarkDown5       0.189922
       CPI             0.317250
       Unemployment   -0.230413
       IsHoliday       0.208556
       Weekly_Sales    1.000000
4      Temperature    -0.225583
       Fuel_Price      0.211549
       MarkDown1      -0.126040
       MarkDown2      -0.179873
       MarkDown3       0.436314
       MarkDown4      -0.067858
       MarkDown5       0.120153
       CPI             0.351157
       Unemployment   -0.337015
       IsHoliday       0.153388
       Weekly_Sales    1.000000
5      Temperature    -0.175517
       Fuel_Price      0.167352
       MarkDown1      -0.022858
       MarkDown2      -0.039349
       MarkDown3       0.666766
       MarkDown4       0.004405
       MarkDown5       0.108503
       CPI             0.308261
       Unemployment   -0.207043
       IsHoliday       0.302525
       Weekly_Sales    1.000000
6      Temperature    -0.084863
       Fuel_Price     -0.103356
       MarkDown1      -0.090601
       MarkDown2      -0.088027
       MarkDown3       0.425505
Name: Weekly_Sales, dtype: float64

The above correlation table shows that the MarkDown3 is having higher impact on the sales compared to other features.